### Terraform Plan for Stage 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.app.aws_route53_zone.this will be destroyed
  # (because aws_route53_zone.this is not in configuration)
  - resource "aws_route53_zone" "this" {
      - arn                 = "arn:aws:route53:::hostedzone/Z0722810AV0KRO9KN5XS" -> null
      - comment             = "Managed by Terraform" -> null
      - force_destroy       = false -> null
      - id                  = "Z0722810AV0KRO9KN5XS" -> null
      - name                = "stage.design.vy.no" -> null
      - name_servers        = [
          - "ns-1366.awsdns-42.org",
          - "ns-160.awsdns-20.com",
          - "ns-1704.awsdns-21.co.uk",
          - "ns-733.awsdns-27.net",
        ] -> null
      - primary_name_server = "ns-733.awsdns-27.net" -> null
      - tags                = {
          - "Application" = "digitalekanaler-designmanual"
          - "Environment" = "stage"
        } -> null
      - tags_all            = {
          - "Application" = "digitalekanaler-designmanual"
          - "Environment" = "stage"
          - "application" = "digitalekanaler-designmanual"
          - "repo"        = "spor"
          - "terraform"   = "true"
        } -> null
      - zone_id             = "Z0722810AV0KRO9KN5XS" -> null
        # (1 unchanged attribute hidden)
    }

  # module.app.module.cloudfront_ssr.aws_acm_certificate.cloudfront must be replaced
+/- resource "aws_acm_certificate" "cloudfront" {
      ~ arn                       = "arn:aws:acm:us-east-1:339713113237:certificate/007cc93d-58e0-4445-8823-892d9ad81d64" -> (known after apply)
      ~ domain_name               = "stage.design.vy.no" -> "designmanual.stage.vylabs.io" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "stage.design.vy.no"
              - resource_record_name  = "_01389e0da5b0547e4398c3ed80adf3d6.stage.design.vy.no."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_6f54842553ae95e2784bc31973c7a290.xlfgrmvvlj.acm-validations.aws."
            },
          + {
              + domain_name           = "designmanual.stage.vylabs.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:339713113237:certificate/007cc93d-58e0-4445-8823-892d9ad81d64" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-11-20T23:59:59Z" -> (known after apply)
      ~ not_before                = "2025-10-22T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "stage.design.vy.no",
          + "designmanual.stage.vylabs.io",
        ]
      - tags                      = {} -> null
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
          - export                                      = "DISABLED" -> null
        }
    }

  # module.app.module.cloudfront_ssr.aws_acm_certificate_validation.cloudfront must be replaced
-/+ resource "aws_acm_certificate_validation" "cloudfront" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:339713113237:certificate/007cc93d-58e0-4445-8823-892d9ad81d64" -> (known after apply) # forces replacement
      ~ id                      = "2025-10-22 10:42:54.159 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_01389e0da5b0547e4398c3ed80adf3d6.stage.design.vy.no",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.app.module.cloudfront_ssr.aws_cloudfront_distribution.this will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ aliases                         = [
          - "stage.design.vy.no",
          + "designmanual.stage.vylabs.io",
        ]
        id                              = "E1QEGTKX2K9D0J"
        tags                            = {}
        # (23 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:339713113237:certificate/007cc93d-58e0-4445-8823-892d9ad81d64" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["designmanual.stage.vylabs.io"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z091299017AL6BP0WEP6W"
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["stage.design.vy.no"] will be destroyed
  # (because key ["stage.design.vy.no"] is not in for_each map)
  - resource "aws_route53_record" "cert_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_01389e0da5b0547e4398c3ed80adf3d6.stage.design.vy.no" -> null
      - id                               = "Z0722810AV0KRO9KN5XS__01389e0da5b0547e4398c3ed80adf3d6.stage.design.vy.no._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_01389e0da5b0547e4398c3ed80adf3d6.stage.design.vy.no" -> null
      - records                          = [
          - "_6f54842553ae95e2784bc31973c7a290.xlfgrmvvlj.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z0722810AV0KRO9KN5XS" -> null
        # (2 unchanged attributes hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cloudfront_alias["designmanual.stage.vylabs.io"] will be created
  + resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "designmanual.stage.vylabs.io"
      + type            = "A"
      + zone_id         = "Z091299017AL6BP0WEP6W"

      + alias {
          + evaluate_target_health = false
          + name                   = "dmlx0eoq2xrsw.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cloudfront_alias["stage.design.vy.no"] will be destroyed
  # (because key ["stage.design.vy.no"] is not in for_each map)
  - resource "aws_route53_record" "cloudfront_alias" {
      - fqdn                             = "stage.design.vy.no" -> null
      - id                               = "Z0722810AV0KRO9KN5XS_stage.design.vy.no_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "stage.design.vy.no" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z0722810AV0KRO9KN5XS" -> null
        # (2 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "dmlx0eoq2xrsw.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # module.app.module.cloudfront_ssr.aws_ssm_parameter.for_pipeline will be updated in-place
  ~ resource "aws_ssm_parameter" "for_pipeline" {
        id              = "/__deployment__/applications/digitalekanaler-designmanual/cloudfront_domain_name"
      + insecure_value  = (known after apply)
        name            = "/__deployment__/applications/digitalekanaler-designmanual/cloudfront_domain_name"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 2 -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_lb_listener_rule.replacement["0"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "replacement" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:339713113237:listener-rule/app/common-services-alb-alb/68013d1e868afe73/40b90bdc4b91ae7c/a5163c3d0fa3e924"
        tags         = {}
        # (5 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "stage.design.vy.no",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "designmanual.stage.vylabs.io",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

  # module.app.module.ssr_task.aws_lb_listener_rule.service["0"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "service" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:339713113237:listener-rule/app/common-services-alb-alb/68013d1e868afe73/9ba7a735a3186a57/5f573fafcb48022c"
        tags         = {}
        # (5 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "stage.design.vy.no",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "designmanual.stage.vylabs.io",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 4 to change, 5 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit 46d6bfc8a01759e1de00d745331ea993eca0b60f*
*Plan generated at: 2025-10-23 08:43:31 UTC*
